{
  "upload_id": "12bb913b-8ee5-44a3-a565-8c75ee33259b",
  "original_filename": "W2-2-mumm2011proximics (1).pdf",
  "upload_date": "2025-02-04T20:23:01.841033",
  "extraction_data": {
    "pages": [
      {
        "page_number": 1,
        "text": "Human-Robot Proxemics: Physical and Psychological \nDistancing in Human-Robot Interaction \n<br><br>Jonathan Mumm \n<br><br>Department of Computer Sciences \nUniversity of Wisconsin–Madison \n1210 W. Dayton St., Madison, WI 53706, USA \n<br><br>mumm@cs.wisc.edu \n<br><br>Bilge Mutlu \n<br><br>Department of Computer Sciences \nUniversity of Wisconsin–Madison \n1210 W. Dayton St., Madison, WI 53706, USA \n<br><br>bilge@cs.wisc.edu\n<br><br>ABSTRACT \nTo seamlessly integrate into the human physical and social \nenvironment, \nrobots \nmust \ndisplay \nappropriate \nproxemic \nbehavior—that is, follow societal norms in establishing their \nphysical and psychological distancing with people. Social-\nscientific theories suggest competing models of human proxemic \nbehavior, but all conclude that individuals’ proxemic behavior is \nshaped by the proxemic behavior of others and the individual’s \npsychological closeness to them. The present study explores \nwhether these models can also explain how people physically and \npsychologically distance themselves from robots and suggest \nguidelines for future design of proxemic behaviors for robots. In a \ncontrolled laboratory experiment, participants interacted with \nWakamaru to perform two tasks that examined physical and \npsychological distancing of the participants. We manipulated the \nlikeability (likeable/dislikeable) and gaze behavior (mutual \ngaze/averted gaze) of the robot. Our results on physical distancing \nshowed that participants who disliked the robot compensated for \nthe increase in the robot’s gaze by maintaining a greater physical \ndistance from the robot, while participants who liked the robot did \nnot differ in their distancing from the robot across gaze \nconditions. The results on psychological distancing suggest that \nthose who disliked the robot also disclosed less to the robot. Our \nresults offer guidelines for the design of appropriate proxemic \nbehaviors for robots so as to facilitate effective human-robot \ninteraction. \n<br><br>Categories and Subject Descriptors \nH.1.2 [Models and Principles]: User/Machine Systems – human \nfactors. H.5.2 [Information Interfaces and Presentation]: User \nInterfaces – evaluation/methodology, user-centered design. \n<br><br>General Terms \nDesign, Experimentation, Human Factors. \n<br><br>Keywords \nHuman-robot \ninteraction, \nhumanlike \nrobots, \nproxemics, \ndistancing, gaze, proximity, disclosure, Wakamaru. \n<br><br>1. INTRODUCTION \nRobots promise widespread integration into the human social and \nphysical environment in such domains as healthcare, education, \nand public services. A key consideration for the design of such \nrobots is proxemics—physical and psychological distancing from \nothers [11]. People might perceive robots that do not show \nappropriate distancing behavior as threatening and disruptive to \ntheir social environments and work practices [20]. On the other \nhand, carefully designed proxemic behaviors in robots might \nfoster closer human-robot relationships and enable widespread \nacceptance of robots, contributing to their seamless integration \ninto society. \n<br><br>The key to designing proxemic behaviors that follow societal \nnorms into robots is to first gain an understanding of how people \ndistance themselves from others, particularly the cues that help \nindividuals maintain appropriate social distances and the social \nand cognitive outcomes of interpersonal distancing. Research in \nhuman communication has extensively studied human proxemic \nbehavior and developed a number of models that integrate \nproxemic cues and predict how these cues might affect human \ncommunication [3,9,10,11,16,21]. These models have formulated \nphysical and psychological distancing in terms of the amount of \nmutual gaze, physical proximity, initial attraction, and other \ninterpersonal factors such as the topic of a conversation, the \namount of smiling, and gender, age, and ethnic configuration of \nthe individuals [11,13]. Four prominent models—compensation \n[3], \nreciprocity [10,14], \nattraction-mediation \n[9,16], \nand \nattraction-transformation [21]—offer competing predictions on \nhow individuals respond to attempts by others to change \ndistancing. \n<br><br>While a small number of studies in human-robot interaction have \nexplored physical distancing [22,24], we lack a comprehensive \nmodel of how people distance themselves from robots and the role \nof verbal and nonverbal cues in this process. In this paper, we \n<br><br> \n<br><br>Permission to make digital or hard copies of all or part of this work for \npersonal or classroom use is granted without fee provided that copies are \nnot made or distributed for profit or commercial advantage and that \ncopies bear this notice and the full citation on the first page. To copy \notherwise, or republish, to post on servers or to redistribute to lists, \nrequires prior specific permission and/or a fee. \nHRI’11, March 6–9, 2011, Lausanne, Switzerland. \nCopyright 2011 ACM  978-1-4503-0561-7/11/03...$10.00. \n<br><br><a href='#' class='figure-link' data-figure-url='/static/uploads/12bb913b-8ee5-44a3-a565-8c75ee33259b/figures/aca3b969-eb88-451f-b676-82ae1ac9ea13.jpeg'>Figure 1</a>. The robot maintaining mutual gaze (left) and \navoiding gaze (right) with a participant. \n<br><br>331\n<br><br>",
        "figures": [
          {
            "ref": "Figure 1",
            "url": "/static/uploads/12bb913b-8ee5-44a3-a565-8c75ee33259b/figures/aca3b969-eb88-451f-b676-82ae1ac9ea13.jpeg"
          }
        ]
      },
      {
        "page_number": 2,
        "text": "investigate which of the four prominent models of interpersonal \ndistancing (illustrated in <a href='#' class='figure-link' data-figure-url='/static/uploads/12bb913b-8ee5-44a3-a565-8c75ee33259b/figures/f8597656-1e01-4a70-9eef-7e3b8c106ede.png'>Figure 2</a>) might best explain human-\nrobot proxemics and suggest guidelines for the design of robots \nthat effectively use verbal and nonverbal cues to establish closer \nrelationships with people. \n<br><br>The next section introduces these models, reviews related work in \nhuman-computer \ninteraction \nand \nhuman-robot \ninteraction \nresearch, and presents our hypotheses. In the remainder of the \npaper, we describe our methodology, present our results, and \ndiscuss the implications of our findings for the design of robot \nproxemic behavior. \n<br><br>2. BACKGROUND \nAnthropologists, sociologists, and psychologists have extensively \nstudied human proxemic behavior—physical and psychological \ninterpersonal distancing—since the 1920s. Bogardus [7] observed \nthat people maintained certain “social distances” from members of \nother ethnic groups. Moreno [17,18] formulated that the distance \nbetween groups depended on the amount of attraction between the \ngroups. Hall [11] further detailed these observations and described \nthe \ndifferent \ndistances \nindividuals \nmaintained \nbetween \nthemselves, the factors that affected interpersonal distancing, and \nthe differences in distancing behavior across cultures. These \ninitial descriptions of proxemic behavior led to the development \nof a number of theoretical models that have attempted to explain \ninterpersonal distancing. In this section, we describe four such \nmodels (also illustrated in <a href='#' class='figure-link' data-figure-url='/static/uploads/12bb913b-8ee5-44a3-a565-8c75ee33259b/figures/f8597656-1e01-4a70-9eef-7e3b8c106ede.png'>Figure 2</a>), discuss the foundations and \npredictions of each model, and provide an overview of prior work \non proxemics in human-computer interaction and human-robot \ninteraction research. \n<br><br>The Compensation (or Equilibrium) Model  \nArgyle and Dean [3] developed a model of interpersonal \ndistancing that suggested an equilibrium in the distance between \ntwo individuals. Based on this model, when individuals increase \ntheir closeness (or decrease distance) with their partners, their \npartners compensate for this increase by decreasing closeness with \nthem. This model formulated distancing in terms of eye contact, \nphysical proximity, intimacy of topic, the amount of smiling, and \nso on and argued that compensation could manifest itself in any of \nthese components. For instance, the equilibrium models suggests \nthat if an individual maintains a high amount of eye contact, her \npartner might compensate for this increase in closeness by \ndecreasing her amount of gaze or by physically distancing herself \nfurther from her partner. To illustrate the equilibrium model, \nArgyle and Dean [3] conducted an experiment in which they \nmanipulated a confederate’s distance from the participants. Their \nresults showed for all gender combinations a compensatory effect; \nparticipants maintained less eye contact when their proximity to \nthe experimenter increased. \n<br><br>The Reciprocity Model \nThe first model, suggested by clinical-psychological research on \ndisclosure processes, focused on psychological distancing and \nhow interpersonal distancing affects how much people disclose \nwith each other. This second model suggests that, in dyadic \ninteraction, when one increases closeness (or decreases \ndistancing), the other reciprocates and increases closeness to the \nother person [10,14]. Jourard and Friedman [14] observed a linear \nincrease in participants’ self-disclosure when the experimenter \nincreased disclosure by means of verbal disclosure touching. \n \n<br><br>A critical review of the compensation and reciprocity models \nshows that these two models originate from distinct theoretical \norientations and predict incompatible outcomes [9]. The \ncompensation model has its origins in research on nonverbal \ncommunication that examines such cues as eye contact, body \norientation, and posture to study social processes. The reciprocity \nmodel stems from research on the verbal aspects of interpersonal \ncommunication such as speech fluency, latency, and breadth and \ndepth of disclosure. These distinct theoretical orientations and \nincompatible predictions have led researchers to develop models \nthat bridge these competing explanations of distancing behavior. \nThe most prominent two such models are the attraction-mediation \nand attraction-transformation. \n<br><br>The Attraction-Mediation Model \nFirestone [9] and Kaplan [16] argue that the level of attraction \nbetween the individuals (can also be formulated as liking, \ncloseness, or rapport) at the onset of the interaction determines the \ndistancing behavior. The model suggests that individuals with \nhigh levels of attraction between them will maintain high levels of \ncloseness independent from changes in their partners’ distancing. \nIndividuals with low levels of attraction, however, will maintain \nlow levels of closeness regardless of changes in their partners’ \ndistancing behavior.  \n<br><br>The Attraction-Transformation Model \nA fourth model, developed by Patterson [21], incorporated the \nreciprocity and compensation models and suggested that the level \nof attraction between individuals at the onset of the interaction \naffects whether individuals compensate or reciprocate. This model \nsuggests that if two individuals initiate interaction at a positive \nfooting that increases mutual attraction, an attempt by one of the \nindividuals to increase closeness will be reciprocated by the other \nindividual. On the other hand, the other individual will \n<br><br><a href='#' class='figure-link' data-figure-url='/static/uploads/12bb913b-8ee5-44a3-a565-8c75ee33259b/figures/f8597656-1e01-4a70-9eef-7e3b8c106ede.png'>Figure 2</a>. The four models of interpersonal distancing \n(adapted from Kaplan et al. [15]). \n<br><br>332\n<br><br>",
        "figures": [
          {
            "ref": "Figure 2",
            "url": "/static/uploads/12bb913b-8ee5-44a3-a565-8c75ee33259b/figures/f8597656-1e01-4a70-9eef-7e3b8c106ede.png"
          }
        ]
      },
      {
        "page_number": 3,
        "text": "compensate for the attempt, if two individuals have a low level of \ninitial mutual attraction. \n<br><br>Kaplan and his colleagues [15] compared these four models and \nfound that the reciprocity model best predicted how much \nparticipants verbally disclosed to the experimenter and the \nattraction-transformation model explained how much participants’ \nmaintained eye contact with the experimenter. More specifically, \nwhen the confederate disclosed more information about herself, \nthe participant reciprocated, both liked and disliked confederates, \nby disclosing more information about herself. Participants’ \nnonverbal behavior showed a different pattern; they reciprocated \nthe liked confederate’s disclosure by increasing the amount of \ngaze and compensated for the disliked confederate’s attempt for \nincreasing closeness by reducing it. \n<br><br>Other Factors that Affect Interpersonal Distancing \nWhile the four models we present here consider two main effects \non distancing behavior, increased closeness by the other party (by \nmeans of increased gaze, proximity, disclosure, etc.) and \ninterpersonal attraction or liking, research in proxemics suggests \nthat interpersonal distancing is also affected by such factors as \ncultural background [11], ethnic group [6], gender [2,6,23], age \n[6], physical attractiveness [15], and body orientation [4,13]. Hall \n[11] observed significant differences in distancing behaviors \nacross cultures. For instance, an acceptable distance between \nindividuals in the Middle East might be unacceptable and anxiety \narousing for Northern Europeans. Baxter [6] found in a study he \nconducted in the United States significant differences among three \nethnic groups in physical distancing behavior. A number of \nstudies revealed significant differences in distancing behavior \nbetween men and women. Overall, women maintain less physical \ndistance between themselves and others [1,2] and tolerate and \nmore favorably react to gaze cues [23] than men do. Finally, \npeople maintain greater distances between themselves and others \nwhen they are facing the front of another person than when they \nare facing the back [4,13]. While we expect these factors to have a \nsignificant effect on how people distance themselves from robots, \nthe present work does not consider them. \n<br><br>Studies of Distancing in Human-Computer Interaction \nOnly a small number of studies have explored proxemics behavior \nin human-computer interaction. In the most notable of such \nstudies, Bailenson and his colleagues [5] studied physical \ndistancing between participants and a virtual agent in an \nimmersive virtual environment. They manipulated the agent’s \n“realism” incrementally from an inanimate cylinder to an agent \nthat maintained mutual gaze with the participants. Their results \nshowed that participants maintained more distance from the agent \nthan from the inanimate cylinder. They also found that female \nparticipants maintained more space between themselves and the \nagent that maintained mutual gaze them than between themselves \nand the agent that did not maintain mutual gaze, showing a \ncompensatory effect of gaze on distancing. Their results showed \nno differences in male participants’ distancing behavior across \ndifferent levels of realism.  \n<br><br>Studies of Distancing in Human-Robot Interaction \nA small but promising number of studies in human-robot \ninteraction have explored proxemic behavior. Walters and his \ncolleagues [24] studied whether participants conformed to the \nproxemic zones that Hall [11] identified for human social \ninteraction (close intimate, intimate, personal, social, and public \nzones). Their results showed that 60% of their participants \n<br><br>conformed to these zones, while 40% of them stood too close to \nthe robot, suggesting that they did not perceive the robot as a \nsocial actor. They also found that participants’ personality \naffected their distance from the robot; those who were more \nproactive maintained a larger distance between themselves and the \nrobot. Takayama and Pantofaru [22] studied how a robot’s gaze \nbehavior and participant characteristics affected how comfortable \nparticipants rated the distance the robot maintained with them. \nTheir results showed an interaction between participant gender \nand the effect of robot’s gaze in participants’ distance from the \nrobot. Females were comfortable with a larger distance when the \nrobot looked toward their faces then they were when the robot \nlooked toward their legs, while males rated a smaller distance as \ncomfortable when the robot looked toward their faces then they \ndid when it looked at their legs. They also found that participants \nwho had prior experience with robots and those who owned pets \nwere more comfortable with smaller distances than others. \n<br><br>While these studies show promising evidence that people express \nproxemic preferences when they are interacting with robots, a \ncomprehensive theoretical model of physical and psychological \ndistancing is needed to guide the design of proxemic behaviors for \nrobots. \n<br><br>2.1 Hypotheses \nWe formed a number of hypotheses for human-robot proxemics \nbased on the models we presented earlier and findings from \nhuman-computer and human-robot interaction studies. \n<br><br>Hypothesis 1. Following the compensation model, derived from \nnonverbal research, participants will maintain a greater distance \nwith the robot when the robot maintains eye contact with them \nthan they do when it avoids gaze. \n<br><br>Hypothesis 2. Following the attraction-transformation model, \nwhich has been proposed as a bridge to explain verbal and \nnonverbal cues, how much participants like the robot will affect \ntheir distancing behavior with the robot; they will maintain a \ngreater distance with the disliked robot when the robot maintains \neye contact with them than they do when it avoids gaze, while \nmaintaining a smaller distance with the liked robot when the robot \nmaintains eye contact with them than they do when it avoids gaze. \n<br><br>Hypothesis 3. Following the compensation model participants \nwill disclose less to the robot when the robot maintains eye \ncontact with them than they do when it avoids gaze. \n<br><br>In the next section, we describe a controlled laboratory \nexperiment in which we seek to evaluate these competing models \nin a human-robot interaction scenario. \n<br><br>3. METHOD \nWe conducted a laboratory experiment to explore which of the \nfour models of interpersonal distancing best explains proxemic \nbehavior in human-robot interaction.  Experimental design, \nprocedure, measurement, and participant information for the \nexperiment are discussed hereafter. \n3.1 Experimental Design \nWe conducted a two-by-two, between-participants study in which \nwe manipulated Wakamaru’s likeability and gaze behavior and \nmeasured how these manipulations might affect how much \nphysical and psychological distance participants maintained with \nthe robot. We introduced the manipulation for the likeability of \nthe robot prior to starting either task. At the beginning of the \n<br><br>333\n<br><br>",
        "figures": []
      },
      {
        "page_number": 4,
        "text": "experiment, the robot greeted the participant and gave a twenty-\nsecond verbal introduction of the task using a pre-recorded human \nvoice. The manipulation involved changing which monologue was \nplayed during the introduction. In the unlikeable condition, the \nrobot’s monologue was rude, selfish, and urged the participant to \nnot “fool around or waste time”. Conversely in the likeable \ncondition, the robot was kind, pleasant, and empathetic. A pilot \nstudy was conducted to develop and test the effectiveness of this \nmanipulation prior to running the experiment. \n<br><br>We also manipulated the gaze behavior of the robot. In the \n“mutual gaze” condition, the robot looked toward the participant \nas the participant moved around the room; the robot’s eyes \nappeared locked to the direction of the participant’s face (while \nthe participant may or may not maintain eye contact with the \nrobot). Alternatively, in the “averted gaze” condition, the robot \nlooked away from the participant, as the participant moved across \nthe room; the robot’s head looked down and away from the \ndirection of the participant. \n<br><br>In the experiment, participants performed two tasks: the first to \nexamine physical distancing and the second to examine \npsychological distancing.  <a href='#' class='figure-link' data-figure-url='/static/uploads/12bb913b-8ee5-44a3-a565-8c75ee33259b/figures/cf1b30b2-1066-4d1a-b960-d092fdeae51e.png'>Figure 3</a> illustrates the experimental \nsetup for both tasks. \n<br><br>Physical Distancing Task — Following the introduction of the \nlikeability manipulation, participants were instructed to begin the \nphysical distancing task (shown in <a href='#' class='figure-link' data-figure-url='/static/uploads/12bb913b-8ee5-44a3-a565-8c75ee33259b/figures/cf1b30b2-1066-4d1a-b960-d092fdeae51e.png'>Figure 3</a>). This task, an \nadaptation of the task Bailenson and his colleagues [5] used to \nstudy distancing in immersive virtual environments, measured the \n“personal space” that participants place between themselves and \nthe robot as they approach it. The task involved the following:  \n<br><br>The experiment software showed participants a number from one \nto ten and asked them to retrieve the word that corresponded to \nthis number from a piece of paper that we placed at the back of \nthe robot. Participants approached the robot to identify the word \nand returned to their original location to type it in into the \ncomputer. After they entered the word, the software displayed \nanother number and asked them to retrieve the word that \ncorresponded this new number from the back of the robot. We \nrepeated this process five times. \n<br><br>Psychological Distancing Task — The second task involved the \nrobot interviewing participants and measured the amount of \ninformation that the participants were willing to disclose to the \nrobot. The task involved the following: \n<br><br>Near the end of the experiment, participants were told by the \ncomputer that the robot wanted to ask them some personal \nquestions in order to get to know them better. Participants sat at a \ncomputer screen while the robot asked them 17 personal questions \n(i.e., “How often do you lose your temper?,” “Have you ever \nstolen anything?,” “Have you ever cheated on a romantic \npartner?”). When the robot asked each question, five multiple-\nchoice answers, which the participant could select, appeared on \nthe screen. Four of the five answers were designed to cover the \npossible range of responses for that particular question and the \nfifth answer was “I do not feel comfortable sharing this \ninformation with the robot.” \n3.2 Experimental Procedure \nThe experiment was conducted in a closed room with controlled \nlighting and no outside distraction. Only the robot and one \nparticipant were present in the room throughout duration of the \nexperiment. Participants were brought in to the experiment room \n<br><br>and were asked to sit at a table with a computer screen, keyboard, \nand mouse. We then gave participants a brief description of what \nthey would be asked to do in the experiment and then asked them \nto review and sign a consent form. The experimenter told the \nparticipants that they were going to play a game with the robot. \nAfter consenting, participants were asked to direct their attention \nto the computer screen, which provided the instructions for the \nremainder of the experiment. The experimenter then told \nparticipants that they could press the start button on the screen \nafter he left the room. Upon pressing start, the robot began \nintroducing itself. Following the introduction, the robot told \nparticipants to read the instructions on the computer screen for the \nphysical distancing task. After indicating that they understood the \ninstructions, the computer lead participants through the physical \ndistancing task. Upon completing the physical distancing task, \nparticipants answered the questionnaire and then were asked to \nperform the psychological distancing task.  \n<br><br>To ensure consistency across participants and to avoid human \nerror, the robot’s gaze behavior was controlled autonomously \nusing real-time video processing. A high definition camera \nlocated behind the robot sent video frames to a server in which we \nprocessed and extracted the participant’s position in the room. \nUsing this position, we calculated the appropriate angle for the \nrobot’s gaze and sent updates to the robot to adjust its gaze at an \napproximate rate of 30 times per second. \n<br><br>Following the final task, the researcher re-entered the room and \ndebriefed participants on the purpose of the experiment. The total \nexperiment time was approximately 12 minutes. Participants were \npaid $5 for their participation.  \n3.3 Measurement \nOur experiment involved two independent manipulated variables, \n(1) likeability of the robot, and (2) gaze behavior of the robot. \nBoth \nindependent \nvariables \nwere \nmanipulated \nbetween-\nparticipants. \nThe \ndependent \nvariables \ninvolved \nobjective \nmeasurements \nfor \nevaluating \nphysical \nand \npsychological \ndistancing and subjective measurements for checking whether our \nmanipulations were effective. \n<br><br><a href='#' class='figure-link' data-figure-url='/static/uploads/12bb913b-8ee5-44a3-a565-8c75ee33259b/figures/cf1b30b2-1066-4d1a-b960-d092fdeae51e.png'>Figure 3</a>. In the physical distancing task, participants walked \nbehind the robot to read a word from the list on its back.  In the \npsychological distancing task, participants sat at a computer \ndesk while the robot asked them seventeen personal questions. \n<br><br>334\n<br><br>",
        "figures": [
          {
            "ref": "Figure 3",
            "url": "/static/uploads/12bb913b-8ee5-44a3-a565-8c75ee33259b/figures/cf1b30b2-1066-4d1a-b960-d092fdeae51e.png"
          }
        ]
      },
      {
        "page_number": 5,
        "text": "Physical Distance — Our physical distance measure captured the \namount of personal space that the participants placed between \nthemselves and the robot as they approached it during the physical \ndistancing task. Following previous studies in proxemics [12], we \nused the minimum distance between the participant and the robot \nfor this measure. As pointed out by Bailenson and his colleagues \n[5], minimum distance is preferred over average distance for two \nreasons: (1) minimum distance is a more accurate measure of how \nclose participants were willing to get and (2) participants spend an \nunequal amount of time at specific distances due to the nature of \nthe task, which would lead to inconsistent results when calculating \nthe average distance. \n<br><br>Physical distancing data was gathered using a high-definition \ncamera mounted in the ceiling for capturing videos. The camera \nwas positioned at a right angle directly over the head of the robot. \nVideos were post-processed using motion capture to calculate the \nminimum distance between the mid-point of the robot and the \nmid-point of the participant.  \n<br><br>To calculate relative distance between the participant and the \nrobot, in each frame of the video we needed to locate, (1) the \nabsolute position of the robot and, (2) the absolute position of the \nparticipant. First, the absolute position of the robot was located \nmanually by examining the frame and selecting the robot’s mid-\npoint coordinate. Because both the robot and camera were \nstationary, this only had to be done once and was consistent \nthroughout all videos. Second, the mid-point of the participant \nwas located by finding the difference image between each frame \nin the video and the base background frame (the frame of just the \nroom with no participant in it). The difference image is a \nrepresentation of the movement in a given frame. After getting the \ndifference image, we apply erosion and threshold filters to \neliminate any noise resulting from the video. We also “block out” \nthe robot so that the movement of the robot’s head would not be a \npart of the difference image. After these filters are applied, the \nresult is a binary image, where white pixels represent movement \nand black pixels represent no movement. Because the experiment \ntook place in an isolated room with controlled lighting, we can \nconclude that any movement in the resulting image is solely that \nof the participant. We then calculate the mid-point of all the white \npixels in the image, and the result is the absolute position of the \nparticipant. Now having both the position of the robot and the \nparticipant, we calculate the relative distance between the two in \neach frame. We calculated distance at a rate of ten times per \nsecond. \n<br><br>Given that people distance themselves differently depending on \nwhether they are in front of or behind the other person [4,13], we \ndetermined both back minimum distance and front minimum \ndistance. We achieved this calculation by evaluating which side \nthe mid-point of the participant lied on relative to the mid-point of \nthe robot. Each participant approached the robot five times, and \nthus a total of ten measures for each participant were examined— \nfive front distances and five back distances. \n<br><br>Finally, because distance data was calculated using digital video, \npixels were the unit of measurement we initially used. We then \nconverted pixels to centimeters by approximating the real-world \nsize of a pixel in our video. However, it should be noted that these \nconversions are only approximations and should not be considered \nto be exact real-world distances. \n<br><br>Psychological Distance — Our psychological distance measure \ncaptured the amount of personal information that participants \ndisclosed to the robot during the psychological distancing task. \nThe robot asked participants 17 personal questions. The \nexperiment software provided participants with the option to \ndecline responding to the questions that they felt uncomfortable \nanswering. The number of questions that the participants did \nanswer was used as the measure of psychological distancing from \nthe robot. \n<br><br>Manipulation Checks — Our experiment manipulated the robot’s \nlikeability and gaze behavior. Following the physical distancing \ntask we asked participants to answer a post-experiment \nquestionnaire, which primarily served to check that our \nmanipulations were effective and to gather demographic \ninformation. We used seven-point rating scales anchored by \n“Strongly Disagree” and “Strongly Agree” for all subjective \nquestionnaire \nitems. \nTo \nassess \nwhether \nthe \nlikeability \nmanipulation was effective, the questionnaire included the \nInterpersonal Judgment Scale [8] adapted for the robot, which \nmeasures interpersonal social attraction. We asked participants \nhow much the robot maintained eye contact with them as they \napproached it in order to assess whether the gaze manipulation \nwas effective. \n3.4 Participation \nA total of 60 participants (30 males and 30 females) took part in \nthe experiment. All participants were native English speakers and \nwere recruited on the University of Wisconsin–Madison campus. \nThe ages of the participants varied between 18 and 67 (M = 24.4, \nSD = 10.5). The computer use among participants was very high \n(M = 6.8, SD = 0.54) on a scale from one to seven. Using the same \nscale, their video game use was moderate (M = 4.03, SD = 1.76) \nand their familiarity with robots was relatively low (M = 3.0, SD = \n1.81). Of the 60 participants, 42 reported that they interacted with \npets on a regular basis. \n4. RESULTS \nOur analysis of the data started with manipulation checks for the \nlikability of the robot and the robot’s gaze behavior using analysis \nof variance (ANOVA). Results confirmed that the likability \nmanipulation had a significant effect on how much participants \nliked the robot, F(1,58) = 7.28, p < .01. Participants also rated \nhow much the robot maintained eye contact with them \nsignificantly more in the mutual gaze condition than they did in \nthe averted gaze condition, F(1,58) = 157.40, p < .001, confirming \nthat our gaze manipulation was also successful. \n<br><br>Before analyzing our results, we first look at our measurements in \nthe context of each of the four models of interpersonal distancing: \n<br><br>The reciprocity model predicts that people meet increased \ncloseness by increasing closeness with them. For physical \ndistancing to follow this model, increased gaze from the robot \nshould lead to a decrease in the physical distance participants \nplace between themselves and the robot. For this model to predict \nparticipants’ psychological distancing, increased gaze from the \nrobot should lead to an increase in self-disclosure from \nparticipants. \n<br><br>The compensatory model predicts that people meet increased \ncloseness by others by decreasing closeness with them. This \nmodel’s prediction for physical distancing would suggest that \nincreased gaze from the robot should lead to an increase in \nphysical distance between participants and the robot. For \n<br><br>335\n<br><br>",
        "figures": []
      },
      {
        "page_number": 6,
        "text": "psychological distancing to follow this model, increased gaze \nfrom the robot should lead to a decrease in self-disclosure from \nparticipants. \n<br><br>The attraction-mediation model predicts that people maintain less \ndistance between themselves and a likeable partner and more \ndistance between themselves and a dislikeable partner and, \ntherefore, that increased closeness by others does not affect their \ndistancing behavior. If participants’ physical distancing behavior \nfollowed this model, a likeable robot, regardless of gaze behavior, \nshould lead to a decrease in personal space. For this model to \nexplain participants’ psychological distancing, a likeable robot, \nregardless of gaze behavior, should lead to an increase in self-\ndisclosure from participants. \n<br><br>Finally, the attraction-transformation model predicts that people \nreciprocate an attempt to increase closeness by a likeable partner \nand compensate for such an attempt by a dislikeable partner. For \nparticipants’ physical distancing behavior to follow this model, \nincreased gaze from a likeable robot should lead to a decrease in \npersonal space and increased gaze from a dislikeable robot should \n<br><br>lead to an increase in personal space. This model’s predictions for \npsychological distancing would suggest that increased gaze from a \nlikeable robot should lead to an increase in self-disclosure and \nincreased gaze from a dislikeable robot should lead to a decrease \nin self-disclosure. \n<br><br>We analyzed our data to test which model best fits for both \nphysical and psychological distancing. We analyzed physical \ndistance using a mixed-effects repeated measures ANOVA using \nparticipant IDs, trial IDs, and approach orientations (front or \nback) as random effects and gaze and likeability conditions as \nfixed effects. We analyzed psychological distance using a fixed-\neffects ANOVA. Both analyses also included two measured \nindependent variables, participant gender and pet ownership, as \nfixed effects. \n<br><br>Physical Distance — In the physical distancing task, we asked \nparticipants to walk behind the robot as part of a game and used \nthe actual distance participants placed between themselves and the \nrobot when they approached it as the measure of physical \ndistancing. The physical distance data included 600 total distance \nmeasurements: minimum front and back distances in each of the 5 \ntrials for all 60 participants. Of the 600 measurements, 12 \nmeasurements were excluded from the analysis. In these trials, \nparticipants accidentally hit the “Back” button located on the side \nof the multimedia mouse attached to the experiment computer, \nwhich reset the experiment software and caused a loss of data. \n<a href='#' class='figure-link' data-figure-url='/static/uploads/12bb913b-8ee5-44a3-a565-8c75ee33259b/figures/8ae4af59-ca5c-4782-a373-577bed6e5985.png'>Figure 4</a> illustrates the data points collected from all 60 \nparticipants in the four unique experimental conditions. \n<br><br>Our analysis showed that gaze behavior had a significant effect on \nphysical distance (shown in <a href='#' class='figure-link' data-figure-url='/static/uploads/12bb913b-8ee5-44a3-a565-8c75ee33259b/figures/df678b6a-5742-45a6-9d14-744e11657032.svg'>Figure 5a</a>). When the robot increased \nits amount of gaze (the “mutual gaze” condition), participants \nsignificantly increased the distance they placed between \nthemselves and the robot, F(1,584) = 13.66, p < .001. Our analysis \nalso found a significant interaction between likeability and gaze \nbehavior, F(2,584) = 7.95, p < .01. Participants who disliked the \nrobot distanced themselves significantly further when the robot \nincreased its amount of gaze, a compensatory effect, F(1,584) = \n20.75, p < .001. However, participants who liked the robot did not \nchange how they distanced themselves as the robot increased its \ngaze, F(1,584) = 0.41, p = ns. This result best fits the attraction-\ntransformation model. We discuss this result further in the \nDiscussion section. \n<br><br>Figure 5. Results on physical and psychological distance: (a) the interaction between gaze behavior and likeability on physical \ndistance, (b) the interaction between gaze behavior and participant gender on physical distance, and (c) the effect of likeability on \npsychological distance. \n<br><br><a href='#' class='figure-link' data-figure-url='/static/uploads/12bb913b-8ee5-44a3-a565-8c75ee33259b/figures/8ae4af59-ca5c-4782-a373-577bed6e5985.png'>Figure 4</a>. All position data collected from participants in the \nphysical distancing task in each of the four conditions. \n<br><br>336\n<br><br>",
        "figures": [
          {
            "ref": "Figure 5a",
            "url": "/static/uploads/12bb913b-8ee5-44a3-a565-8c75ee33259b/figures/df678b6a-5742-45a6-9d14-744e11657032.svg"
          },
          {
            "ref": "Figure 4",
            "url": "/static/uploads/12bb913b-8ee5-44a3-a565-8c75ee33259b/figures/8ae4af59-ca5c-4782-a373-577bed6e5985.png"
          }
        ]
      },
      {
        "page_number": 7,
        "text": "Our analysis showed a main effect of gender on physical \ndistancing (shown in <a href='#' class='figure-link' data-figure-url='/static/uploads/12bb913b-8ee5-44a3-a565-8c75ee33259b/figures/91d2ccbb-a83e-43e8-9858-63c194adae15.png'>Figure 5b</a>). Males distanced themselves \nsignificantly further than females, F(1,586) = 6.87, p < .01. Our \nanalysis also found a significant interaction between gaze \nbehavior and participant gender. Consistent with prior work that \nsuggests that females tend to tolerate and react more favorable to \ngaze than males [23], our analysis shows that females did not \nchange how they distanced themselves as the robot increased its \ngaze, F(1,584) = 0.46, p = ns. Males, however, distanced \nthemselves significantly further when the robot increased its \namount of gaze, F(1,584) = 28.16, p < .01. \n<br><br>Our analysis showed a main effect of pet ownership on physical \ndistancing. Pet owners distanced themselves significantly further \nthan non-pet owners, F(1,586) = 8.13, p < .01. Our analysis also \nfound a significant triple interaction between pet ownership, gaze \nbehavior, and likeability, F(3,580) = 4.30, p < .04. Space \nconstraints do not permit extended discussion on this analysis. \n<br><br>Consistent with past distancing research [4,12], our analysis \nshowed that participants distanced themselves differently \ndepending on whether they were in front of or behind the robot. \nParticipants distanced themselves significantly further from the \nrobot when they were in front of it compared to when they were \nbehind it, F(1,292) = 474.80, p < .001. \n<br><br>Psychological Distance — In the psychological distance task, the \nrobot asked participants 17 personal questions. We provided \nparticipants with the option to answer or skip the question if they \ndid not feel comfortable sharing that information with the robot. \nPsychological distance, a measure of self-disclosure, is the \nnumber of questions participants were willing to answer. \n<br><br>Our analysis showed a marginal main-effect of robot likeability on \npsychological distance (shown in Figure 5c). Participants \ndisclosed marginally more information with a likeable robot \ncompared to an unlikeable robot, F(1,58) = 3.45, p < .07. Our \nanalysis further showed that gaze behavior of the robot had no \neffect on psychological distance, F(1,58) = 0.36, p = ns. No other \nsignificant interactions were found. This result suggests that the \nattraction-mediation \nmodel \nbest \nexplains \nhuman-robot \npsychological distancing. We discuss this result further in the \nDiscussion section. \n5. DISCUSSION \nOur results on physical distancing showed strong support for our \nfirst hypothesis; participants maintained a greater distance with \nthe robot when it established mutual gaze with them, following \nthe compensation model of interpersonal distancing. However, \nour results also showed partial support for the competing \nattraction-transformation model; participants’ compensatory \ndistancing behavior was affected by how much they liked the \nrobot. Specifically, participants compensated for increased \ncloseness by a robot they disliked by maintaining a greater \ndistance with the robot. On the other hand, increased closeness by \na robot they liked did not affect their distancing behavior. Results \non psychological distancing did not confirm our hypothesis, \ninstead providing partial support for the attraction-mediation \nmodel. Participants disclosed more to the robot they liked than \nthey did to the disliked robot, while the increased closeness by the \nrobot did not affect their disclosure. These two models for \nphysical \nand \npsychological \nhuman-robot \ndistancing \nare \nrepresented in Figure 6.   \n<br><br>Our analysis also showed that participants’ gender and pet \nownership affected their distancing behavior. Overall, men \nmaintained a greater distance from the robot than women did. \nThey also compensated for increased closeness by the robot by \nincreasing their distance, while increased gaze by the robot did \nnot affect the women’s distancing from the robot, consistently \nwith the finding that women tolerate and react more positively \ntoward gaze cues [23]. Pet owners also maintained an overall \ngreater distance from the robot than others did, following the \nfinding that pet owners might be more sensitive to social cues \npresented by robots [19]. \n<br><br>Design Implications — Our findings offer three significant \nimplications for the design of proxemic behavior for robots. First, \nrobots need to be designed to initially establish a certain level of \nlikeability or rapport with people before seeking physical and \npsychological closeness with them. Failure to do so might cause \npeople to physically distance themselves from robots, avoid \ndisclosing personal information, or ceasing to interact with the \nrobot altogether. Second, robots that are designed to function in \nsituations that do not allow them to establish rapport with people \n(e.g., public spaces) need to be mindful of how they employ cues \nthat might increase closeness in their interactions with people. \nUnder low levels of rapport, people might compensate for the \nrobot’s attempts to increase closeness by withdrawing themselves \nfrom it. Finally, robots need to be designed to consider individual \ncharacteristics—such as gender and pet ownership—when they \nestablish their distancing with people. For instance, seeking to \nincrease closeness by maintaining more eye contact with both \ngenders equally might cause males to compensate for this increase \nand distance themselves from the robot.  \n<br><br>Limitations — The results presented here have a number of \nlimitations. First, Wakamaru’s design might have affected \nparticipants’ perceptions of its gaze cues and likability. While our \nmanipulation checks showed strong effects of the gaze and \nlikability manipulations, that the robot does not have articulate \neyes and its nonthreatening design in terms of size and physical \nfeatures might have prevented even stronger effects. Second, \nbecause we focused on understanding people’s distancing \nbehavior with robots and how robot gaze and likability affected \nthis behavior, we limited the robot’s behaviors to speech and gaze. \nTherefore, we do not know the generalizability of our results to \nsituations in which robots use a wider range of behavioral cues. \nLastly, we used gaze cues to manipulate the robot’s distancing \nfrom people, while alternative behaviors exist such as increasing \n<br><br>Figure 6. Models of human-robot distancing. Participants \nwho disliked the robot compensated for increased gaze by \ndistancing themselves further from it, while those who liked \nthe robot were not affected by increased gaze (left).  \nParticipants who liked the robot disclosed more with the \nrobot than participants who disliked the robot (right). \n<br><br>337\n<br><br>",
        "figures": [
          {
            "ref": "Figure 5b",
            "url": "/static/uploads/12bb913b-8ee5-44a3-a565-8c75ee33259b/figures/91d2ccbb-a83e-43e8-9858-63c194adae15.png"
          }
        ]
      },
      {
        "page_number": 8,
        "text": "or decreasing physical proximity. We plan to conduct future \nstudies that explore how a mobile robot that adjusts its physical \nproximity might affect people’s distancing from it. \n6. CONCLUSION \nRobots must be designed to follow societal norms of physical and \npsychological distancing in order to seamlessly integrate them \ninto the human physical and psychological environment. People \nmight perceive robots that do not follow these norms as disruptive \nand threatening and, eventually, consider them as obstacles rather \nthan assets. On the other hand, establishing and maintaining \nappropriate physical and psychological distances might allow \nrobots to offer smoother and more comfortable interactions. \n<br><br>In this paper, we explored whether existing models of proxemics \nmight explain how people physically and psychologically distance \nthemselves from robots and suggest guidelines for the design of \nproxemic behaviors for robots. In a laboratory experiment with 60 \nparticipants, we evaluated how manipulations in the likeability of \nthe robot and gaze behavior affected participants’ physical \ndistance from the robot and disclosure of personal information. \nOur results showed that participants who disliked the robot \ncompensated for the increase in the robot’s gaze by maintaining a \ngreater physical distance from the robot, while participants who \nliked the robot did not differ in their distancing from the robot \nacross gaze conditions. We also found that participants who \ndisliked the robot disclosed less personal information to the robot. \n<br><br>These results provide us with a comprehensive theoretical model \nof human-robot proxemics that will inform the design of proxemic \nbehaviors for robots. However, further work is required to \nunderstand to what extent these results generalize to other \nsituations, behavioral cues, and robot designs. \nAcknowledgements \nThe National Science Foundation Award IIS-1017952 and an \nequipment loan from Mitsubishi Heavy Industries supported this \nresearch. We would like to thank Jeremy Bailenson and Sara \nKiesler for providing us with valuable feedback on the early \nstages of this project. \nReferences \n[1] Adler, L.L. and Iverson, M.A. 1974. Interpersonal distance \nas a function of task difficulty, praise, status orientation, and \nsex of partner. Perceptual and Motor Skills, 39, 2, 683-692. \n[2] Aiello, J.R. 1977. A further look at equilibrium theory: \nVisual interaction as a function of interpersonal distance. \nJournal of Nonverbal Behavior, 1, 2, 122-140 \n[3] Argyle, M. and Dean, J. 1965. Eye-contact, distance and \naffiliation. Sociometry, 28, 3, 289-304. \n[4] Ashton, N.L. and Shaw, M.E. 1980. Affective reactions to \ninterpersonal distances by friends and strangers. Bulletin of \nthe Psychonomic Society, 15, 5, 306-308. \n[5] Bailenson, J.N., Blascovich, J., Beall, A.C., and Loomis, \nJ.M. 2001. Equilibrium theory revisited: Mutual gaze and \npersonal space in virtual environments. Presence, 10, 6, 583-\n596. \n[6] Baxter, J.C. 1970. Interpersonal spacing in natural settings. \nSociometry, 33, 4, 444-456. \n[7] Bogardus, E.S. 1925. Social distance and its origins. Journal \nof Applied Sociology, 9, 216-226. \n[8] Byrne, D. 1971. The Attraction Paradigm. Academic Press, \nNew York. \n<br><br>[9] Firestone, I. 1977. Reconciling verbal and nonverbal models \nof dyadic communication. Environmental Psychology and \nNonverbal Behavior, 2, 1, 30-42. \n[10] Gouldner, A. 1960. The norm of reciprocity: A preliminary \nstatement. American Sociological Review, 25, 2, 161-178. \n[11] Hall, E.T. 1966. The Hidden Dimension. Doubleday, Garden \nCity, NY. \n[12] Hayduk, W. 1983. Personal space: Where we now stand. \nPsychological bulletin, 94, 2, 293-335. \n[13] Hayduk, W. 1981. The shape of personal space: An \nexperimental investigation. Canadian Journal of Behavioural \nScience, 13, 1, 87-93. \n[14] Jourard, S.M. and Friedman, R. 1970. Experimenter-subject \n“distance” and self-disclosure. Journal of Personality and \nSocial Psychology, 15, 3, 278-282. \n[15] Kaplan, K.J., Firestone, I.J., Klein, K.W., and Sodikoff, C. \n1983. Distancing in dyads: A comparison of four models. \nSocial Psychology Quarterly, 46, 2, 108-115. \n[16] Kaplan, K. 1977. Structure and process in interpersonal \n“distancing”. Journal of Nonverbal Behavior, 1, 2, 104-121. \n[17] Moreno, J.L. 1947. Group psychotherapy: A symposium. \nJournal of Nervous & Mental Disease, 105, 3, 331-332. \n[18] Moreno, J.L. 1934. Who Shall Survive? A New Approach to \nthe Problem of Human Interrelations. Beacon House, New \nYork. \n[19] Mutlu, B., Yamaoka, F., Kanda, T., Ishiguro, H., and Hagita, \nN. 2009. Nonverbal leakage in robots: Communication of \nintentions through seemingly unintentional behavior. In \nProceedings of the 4th ACM/IEEE International Conference \non Human-Robot Interaction (San Diego, CA, March 11 - \n13, 2009). HRI '09. ACM, New York, NY, USA, 69-76. \nDOI= 10.1145/1514095.1514110 \n[20] Mutlu, B. and Forlizzi, J. 2008. Robots in organizations: the \nrole of workflow, social, and environmental factors in \nhuman-robot interaction. In Proceedings of the 3rd \nACM/IEEE International Conference on Human-Robot \nInteraction (Amsterdam, The Netherlands, March 12 - 11, \n2008). HRI '08. ACM, New York, NY, USA, 287-294. DOI= \n10.1145/1349822.1349860  \n[21] Patterson, M. 1976. An arousal model of interpersonal \nintimacy. Psychological Review, 83, 3, 235-245. \n[22] Takayama, L. and Pantofaru, C. 2009. Influences on \nproxemic behaviors in human-robot interaction. In \nProceedings of the 2009 IEEE/RSJ International Conference \non Intelligent Robots and Systems (St. Louis, MO, October \n10 - 15, 2009). IROS '09. IEEE, 5495-5502. DOI= \n10.1109/IROS.2009.5354145 \n[23] Valentine, M.E. and Erlichman, H. 1979. Interpersonal gaze \nand helping behavior. Journal of Social Psychology, 107, 2, \n193-198. \n[24] Walters, M.L., Dautenhahn, K., Te Boekhorst, R., Koay, \nK.L., Kaouri, C., Woods, S., Nehaniv, C., Lee, D., and \nWerry, I. 2005. The influence of subjects' personality traits \non personal spatial zones in a human-robot interaction \nexperiment. In Proceedings of the 2005 IEEE International \nWorkshop on Robots and Human Interactive Communication \n(Nashville, TN, August 13 - 15, 2005). ROMAN '05. IEEE, \n347-352. DOI= 10.1109/ROMAN.2005.1513803 \n<br><br>338\n<br><br>",
        "figures": []
      }
    ]
  }
}